In [1]:
# Import Matplot lib
import matplotlib
import numpy as np
from matplotlib import style
style.use('seaborn')
import matplotlib.pyplot as plt
from config import USER, PASS

In [2]:
import pandas as pd

In [3]:
# Import SQLAlchemy `automap` and other dependencies here
# import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func

In [4]:
# Create an engine

engine = create_engine(f'postgresql://{USER}:{PASS}@localhost/employee_db')
connect = engine.connect()

In [5]:
inspector = inspect(engine)
inspector.get_table_names()

['salaries', 'employees', 'dept_manager', 'departments', 'dept_emp', 'titles']

In [6]:
columns = inspector.get_columns('salaries')
for c in columns:
    print(c['name'], c["type"])

emp_no VARCHAR
salary INTEGER
from_date DATE
to_data DATE

In [7]:
engine.execute('SELECT * FROM salaries LIMIT 10').fetchall()

[('10001', 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26)),
 ('10002', 65828, datetime.date(1996, 8, 3), datetime.date(1997, 8, 3)),
 ('10003', 40006, datetime.date(1995, 12, 3), datetime.date(1996, 12, 2)),
 ('10004', 40054, datetime.date(1986, 12, 1), datetime.date(1987, 12, 1)),
 ('10005', 78228, datetime.date(1989, 9, 12), datetime.date(1990, 9, 12)),
 ('10006', 40000, datetime.date(1990, 8, 5), datetime.date(1991, 8, 5)),
 ('10007', 56724, datetime.date(1989, 2, 10), datetime.date(1990, 2, 10)),
 ('10008', 46671, datetime.date(1998, 3, 11), datetime.date(1999, 3, 11)),
 ('10009', 60929, datetime.date(1985, 2, 18), datetime.date(1986, 2, 18)),
 ('10010', 72488, datetime.date(1996, 11, 24), datetime.date(1997, 11, 24))]

In [8]:
salaries = pd.read_sql("SELECT salary FROM salaries", connect)
salaries.head()

   salary
0   60117
1   65828
2   40006
3   40054
4   78228

In [ ]:
plt.hist(salaries, bins='auto') 
plt.show()